#include <stdio.h>

int main(void)
{
    printf("Подвигаем немного.\n");

    int a = 0b00111000; // 56
    printf("Начальное значение:\t%d\n", a);

    printf("%d: сдвиг <<< на %d = %d\n", a, 1, a << 1); // 111000 -> 1110000 = 112
    printf("%d: сдвиг >>> на %d = %d\n", a, 2, a >> 2); // 111000 -> 1110 = 14

    printf("%d: Операция &:\t%d\n", a, a & 0b111111); //   111000
                                                      // & 111111
                                                      //   111000 = 56

    printf("%d: Операция |:\t%d\n", a, a | 0b111111); //   111000
                                                      // | 111111
                                                      //   111111 = 63

    printf("%d: Операция ^:\t%d\n", a, a ^ 0b111111); //   111000
                                                      // & 111111
                                                      //   000111 = 7

    printf("%d: Инверсия значения:\t%d\n", a, ~a); // 111000 -> 11111111 11111111 11111111 11000111 (?)

    printf("\n\n");
    return 0;
}
